/**
 * Завдання 1
 * 
 * Продукти доманього завднання 6 модуля додати у фікстуру products.json
 * і написати такіж самі тести як і в завданні 6 модуля, але використовуючи фікстури.
 * 
 * Підказка: команду cy.fixture('products.json') можна викликати в лише в середені тесту
 * 
 * Завдання 2, з зірочкою
 * Створити кастомну команду. Є два варіанти, перший складніший, але цікавіший, другий простіший:
 * - подивитися на ваші тести та ідентифікувати повторювані дії. Створити кастомну команду для цих дій для СПРОЩЕННЯ тестів.
 * - створити просту кастомну команду, яка буде приймати selector та виконувати дію click() на ньому. Назівати її наприклад clickOnElement(selector)
 * 
 * Завдання 3, з двома зірочками
 * - у файлі index.d.ts описати типаізацію для вашої кастомної команди та приклад її використання
 */