/**
 * Завдання 1
 * Вам треба автоматизувати наступні сценарії:
 * 
 * Сортування товарів від дешевих до дорогих
 * 1. Відкрити сторінку каталогу
 * 2. Вибрати сортування за ціною від дешевих до дорогих
 * 3. Перевірити, що товари відсортовані за ціною від дешевих до дорогих
 * 
 * Сортування товарів від дорогих до дешевих
 * 1. Відкрити сторінку каталогу
 * 2. Вибрати сортування за ціною від дорогих до дешевих
 * 3. Перевірити, що товари відсортовані за ціною від дорогих до дешевих
 * 
 * Сортування товарів за рейтингом
 * 1. Відкрити сторінку каталогу
 * 2. Вибрати сортування за рейтингом
 * 3. Перевірити, що товари відсортовані за рейтингом
 * 
 * Підказка: сортування за рейтингом - це стандартне сортування. Найпростіший метод буде: 
 * змінити порядок сортування на будь-який інший, 
 * зберегти послідовність товарів, 
 * змінити порядок сортування на рейтинг і порівняти послідовність товарів з попередньо збереженою
 * Але ви можете зробити це як заманеться, найголовніше - це перевірити, що товари відсортовані за рейтингом
 * 
 * Сортування товарів за новизною
 * 1. Відкрити сторінку каталогу
 * 2. Вибрати сортування за ціною від дорогих до дешевих
 * 3. Перевірити, що товари відсортовані новизною
 * 
 * Кнопка "Показати ще" збільшує кількість товарів на сторінці
 * 1. Відкрити сторінку каталогу
 * 2. Перевірити початкову кількість товарів на сторінці (у мене було 60)
 * 3. Натиснути кнопку "Показати ще"
 * 4. Перевірити, що кількість товарів збільшилась вдвічі
 * 
 * Всі тести мають бути виконані в одному блоці describe, але розбиті на окремі it.
 * Не забувайте використовувати before, after, beforeEach, afterEach для організації коду,
 * а також використовуйте PageObject для опису сторінок.
 * 
 * 
 * Завдання 2, з зірочкою, творче
 * Створіть 2-3 сценарія для тестування фільтрів на сторінці каталогу та автоматизуйте їх.
 * Наприклад, в каталозі ноутбуків можна вибрати виробника, процесор, діагональ екрана і т.д.
 * Також можна вибрати діапазон цін.
 * Також можна протестувати пошук брендів у фільтрі.
 * 
 * Ці тести створіть в окремому блоці describe, та над кожним it блоком опишіть назву тесту та кроки.
 */