/**
 * Завдання 1
 * Протестуйте сторінку продукту в магазині Розетка.
 * На сторінці продукту мають бути наявні елементи:
 * 1. Навзва продукту
 * 2. Секція відгуків
 * 3. Навігаційне меню, а в ньому: 
 * "усе про товар", "характеристики", "відгуки", "питання", "відео", "фото", "купують разом"
 * 4. Секція з варіантами продукту: "виберіть колір", "виберіть розмір" і т.п. 
 * 5. Ціна продукту
 * 6. Кнопка додавання в корзину. "Купити"
 * 7. Кнопка купити в кредит
 * 8. Кнопка додавання в для порівняння
 * 9. Кнопка додавання в список бажань
 * 10. Секція додаткових послуг
 * 11. Секція продавця
 * 12. Секція доставки
 * 13. Фото продукту
 * 14. Секція "Також вас можуть зацікавити"
 * 
 * Це завдання можна виконати в одному тесті, або розбити на кілька тестів, в залежності від ваших потреб, але в одному блоці describe.
 * 
 * Завдання 2, з зірочкою
 * Можна виконати лише ті тести, які ви зможете.
 * На сторінці продукту перевірте що:
 * 1. При кліку на кнопку "Купити" відкривається модальне вікно з підтвердженням додавання в корзину
 * 2. При кліку на кнопку "Купити в кредит" відкривається модальне вікно з варіантами кредитуваання
 * 3. При кліку на кнопку "Додати в порівняння" з'являється підказка "Товар додано до порівняння". А при повторному кліку ви перехоите на сторінку порівняння
 * 4. При зміні варіанту продукту змінюється ціна продукту, його опис, тощо
 * 5. При кліки по навігаційному меню відображаються відповідні секції
 * 6. Фото карусель працає в обох напрямках 
 * 
 * Це завдання краще розбити на кілька тестів, в залежності від ваших потреб, але в одному блоці describe.
 */