/**
 * Завдання 1
 * Керуючись набутими знаннями про Page Object, зробіть рефактор коду з попередніх домашніх завдань.
 * 
 * В папці cypress/e2e створіть папку pages і в ній створіть файли: product.js та homepages.js 
 * та перенесіть туди відповідні селектори та/або функції відповідно до потреб.
 * 
 * Подумайте, чи є в тих файлах елементи присутні на обох сторінках? Я
 * Якщо так, то в папці pages створіть папку elements і в ній створіть файли для таких елементів.
 */

/**
 * Завдання 2
 * 
 * Протестуйте картку товару на сторінці каталогу в магазині Розетка.
 * Для опису селекторів використовуйте Page Object.
 * 
 * Карка товару має:
 * 1. Фото товару
 * 2. Назву товару
 * 3. Відгуки
 * 4. Ціну
 * 5. Статус готовості до відправки
 * 6. Кнопку додати в кошик
 * 7. Кнопку додати в улюблені
 * 8. Кнопку порівняти
 * 
 * Переконайтесь, що всі елементи присутні на одній окремій картці!
 * Це завдання можна виконати в одному тесті, або розбити на кілька тестів, в залежності від ваших потреб, але в одному блоці describe.
 */

/**
 * Завдання 3, з зірочкою
 * 
 * Для опису селекторів використовуйте Page Object.
 * Протестуйте функціонал картки товару на сторінці каталогу в магазині Розетка:
 * 1. Перевірити перехід на сторінку товару при кліку на картку товару
 * 2. Додаєте товар в кошик
 * 3. Додати товар в кошик і натиснути ще раз на кнопку додати в кошик
 * 4. Перевірити, що додатковий опис товару зʼявився при наведенні на картку товару
 * 5. Перевірити перехід на сторінку відгуків при натисканні на кількість відгуків
 * 
 * Це завдання можна виконати в одному тесті, або розбити на кілька тестів, в залежності від ваших потреб, але в одному блоці describe.
 * При необхідності не забувайте використовувати функції before і beforeEach.
 * https://mochajs.org/#hooks
 */