/**
 * Завдання 1
 * Створіть масив з 5 обʼєктів з різних категорій товарів (ноутбуки, іграшки, будь-що), де кожен обʼєкт містить інформацію про продукт: посилання, назву і ціну.
 * Наприклад:
 * [
 *  {
 *    link: 'https://rozetka.com.ua/apple_macbook_air_13_m1_256gb_2020_gold/p245161897/',
 *    name: 'Ноутбук Apple MacBook Air 13" M1 256GB 2020 (MGND3) Gold',
 *    price: 42999
 *  },
 * ]
 * Створіть тест, який буде заходити на посилання обʼєктів і перевіряти, що відображається правильна назва і ціна.
 */

describe.skip('Price and name', () => {
  // приклад
  [
    {
      link: 'https://rozetka.com.ua/apple_macbook_air_13_m1_256gb_2020_gold/p245161897/',
      name: 'Ноутбук Apple MacBook Air 13" M1 256GB 2020 (MGND3) Gold',
      price: 42999
    },
    // ще 4 обʼєкти
  ].map((testData) => it(`Checking price for: ${testData.name}`, () => {
    // тут ваш код
  }));
});

/**
 * Завдання 2, з зірочкою
 * 
 * Створіть масив з 5 обʼєктів з різних категорій товарів (3 товари зі знижкою і 2 товари без) де кожен обʼєкт містить 
 * інформацію про продукт: посилання, назву, стару ціну і ціну зі знижкою.
 * Якщо товар без знижки, то тест має перевіряти що є лише одна ціна і вона відповідає ціні без знижки.
 * Якщо товар зі знижкою, то тест має перевіряти що є дві ціни і вони відповідають ціні зі знижкою і без.
 * 
 * Наприклад:
 * [
 *   {
 *     link: 'https://rozetka.com.ua/apple_macbook_air_13_m1_256gb_2020_gold/p245161897/',
 *     name: 'Ноутбук Apple MacBook Air 13" M1 256GB 2020 (MGND3) Gold',
 *     oldPrice: 46999,
 *     price: 42999
 *   },
 * ]
 */
