/**
 * Завдання 1
 * Вам необхідно протестувати домашню сторінку магазину Розетка.
 * На домашній сторінці мають бути наявні елементи:
 * 1. Логотип
 * 2. Пошукове поле
 * 3. Кнопка пошуку
 * 4. Корзина
 * 5. Кнопка профілю
 * 6. Великий банер
 * 7. Меню з категоріями товарів
 * 8. Кнопка входу у особистий кабінет
 * 9. Блок з соціальними мережами
 * 
 * Тести мають бути в одному describe блоку, але розбиті на окремі it блоки. Тобто ви маєте написати 9 тестів мінімум.
 * Для переходу на домашню сторінку використовуйте команду cy.visit('https://rozetka.com.ua/')
 * Для організації тестів використовуйте команди before, beforeEach, after, afterEach
 * 
 * Завдання 2, з зірочкою. 
 * Можна виконати лише ті тести, які ви зможете.
 * 
 * На домашній сторінці розетки перевірте функціонал:
 * 1. Пошуку. Знайти товар 'iphone' і перевірити чи відображаються товари з цією назвою.
 * 2. Зміни мови. Змінити мову на ua|ru і перевірити чи змінилась мова на декількох елементах.
 * 3. Зміни картинки в основному банері. 
 * 4. Каталогу. Перевірити чи відображаються меню каталогу при натисканні на кнопку 'Каталог', та чи змінюються категорії якщо навести курсор на категорію.
 * 
 * Тести мають бути в одному describe блоку, але розбиті на окремі it блоки.
 */
