/**
 * Завдання 1
 * Створіть тест який буде перехоплювати пошуковий запит на сайті rozetka.com.ua
 * та буде перевіряти дані отримані з пошукового запиту з даними отриманими з пошукового запиту на фронтенді.
 * 
 * Наприклад:
 * Пошуковий запит: samsung
 * повертає 3 додаткові категорії для пошуку та 
 * одну рекомендацію для пошуку
 * 
 * Пошуковий запит: цйуцйуйцуйцу
 * повертає текст "По вашому запиту нічого не знайдено. Уточніть свій запит"
 * 
 * Завдання 2, з зірочкою
 * Створити запити до https://api2.binance.com/api/v3/ticker/24hr, які:
 * - повертають код 200, та перевірити чи отримані дані відповідають запиту
 * - повертають код 404
 * 
 * Підказка: вам треба дізнатися про failOnStatusCode і як його виставити в false
 */